# Unplace Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Room..::..Unplace Method
Room Class See Also
---
Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Unplace()
```

Visual Basic
---
```text
Public Sub Unplace
```

Visual C++
---
```text
public:
void Unplace()
```

# Remarks
Note that current room is changed to unplaced and all corresponding rooms which in other group instance are deleted when in group edit mode.
# See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace